Dlubal.RFEM5.IResultCombination
Interface for working with result combination

Dlubal.RFEM5.IResultCombination.GetData
Gets result combination parameters.
Returns: Result combination parameters

Dlubal.RFEM5.IResultCombination.SetData(System.UInt32@)
Sets result combination parameters.
Combination: Result combination parameters

Dlubal.RFEM5.IResultCombination.Delete
Deletes result combination.

Dlubal.RFEM5.IResultCombination.HasResults
Indicates if result combination has any results.
Returns: True if the result combination has any results, otherwise false.

Dlubal.RFEM5.IResultCombination.GetQuadraticCombination
Gets quadratic combination parameters.
Returns: Quadratic combination parameters

Dlubal.RFEM5.IResultCombination.SetQuadraticCombination(System.UInt32@)
Sets quadratic combination parameters.
Combination: Quadratic combination parameters

Dlubal.RFEM5.IResultCombination.GetLoadings
Gets list of loadings in the result combination.
Returns: Array of loadings in the result combination.

Dlubal.RFEM5.IResultCombination.SetLoadings(System.UInt32@)
Sets list of loadings in result combination.
Loadings: Array of loadings to be set in the result combination.